# -*- coding: utf-8 -*-
import os
import sys

name = {
		1: "၁။  ၁၃-၁-၁၉၆၆  မိုးေကာင္းအလႉဒါန - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		2: "၂။  ၅-၃-၁၉၆၃  ေက်ာက္သေဘၤာဆရာေတာ္ႏွင့္ အေမးအေျဖ - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		3: "၃။  ဥပါဒါန္ကၡႏၶာ - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		4: "၄။  အဂၢသာဝက - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		5: "၅။  အသုံးလံုး - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		6: "၆။  ဦးေအာင္ထြန္းႏွင့္ အရွင္ဥကၠ႒ - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		7: "၇။  ရုပ္ထူး၊ နာမ္ထူး - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		8: "၈။  ၂၇-၁၂-၂၉၆၃  သတိပ႒ာန္(၄)ပါး - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		9: "၉။  ေထရုပတၱိ - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		10: "၁၀။  သတိပ႒ာန္(၄)ပါး - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		11: "၁၁။  သစၥာ(၂)ပါး - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		12: "၁၂။  မဂ္ေလးပါး မေဟာ္သဓာ - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		13: "၁၃။  နိဗၺာန္ေလးဆင့္ - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		14: "၁၄။  ေစတီ(၂)ပါး - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",
		15: "၁၅။  ထီးရိုးမိုးႀကိဳးပစ္ - သဲအင္းဂူဆရာေတာ္ဘုရားႀကီး ဦးဥကၠ႒",	 
       }
       
playlist = 'မဟာသတိပ႒ာနသုတ္'       
print('{} --title="{}" --description="{}" --playlist="{}" {}.mp4'.format('python ../youtube-upload/bin/youtube-upload', \
'သစၥာေလးပါးတရားေတာ္(၁၅-ဆုံး)', 'မဟာသတိပ႒ာနသုတ္ ဓမၼာႏုပႆနာ၊ သစၥာပိုင္းကို ေက်းဇူးရွင္မဟာစည္ဆရာေတာ္ႀကီး အက်ယ္ဖြင့္ျပေဟာၾကားေတာ္မူခဲ့ေသာ သစၥာေလးပါးတရားေတာ္(၁၅-ဆုံး)', playlist, 359625774511696))
if 0 == os.system('{} --title="{}" --description="{}" --playlist="{}" {}.mp4'.format('python ../youtube-upload/bin/youtube-upload', \
    'သစၥာေလးပါးတရားေတာ္(၁၅-ဆုံး)', 'မဟာသတိပ႒ာနသုတ္ ဓမၼာႏုပႆနာ၊ သစၥာပိုင္းကို ေက်းဇူးရွင္မဟာစည္ဆရာေတာ္ႀကီး အက်ယ္ဖြင့္ျပေဟာၾကားေတာ္မူခဲ့ေသာ သစၥာေလးပါးတရားေတာ္(၁၅-ဆုံး)', playlist, 359625774511696)):
    print("Yes")
else:
    print("No")
    sys.exit()
"""	   
playlist = 'မဟာသတိပ႒ာနသုတ္'
for key, value in sorted(name.items()):
    print('{} {}"{}" {} "{}" {}.avi'.format('python ../youtube-upload/bin/youtube-upload', '--title=', value, '--playlist', playlist, key))

    if 0 == os.system('{} {}"{}" {}"{}" {}.avi'.format('python ../youtube-upload/bin/youtube-upload', '--title=', value, '--playlist=', playlist, key)):
        print("Yes")
    else:
        print("No")
        sys.exit()
"""


    #os.system('{} {} {}'.format('python youtube-upload/bin/youtube-upload', --title="1.avi"))
